; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-22)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 left ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(gripper left)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(free left)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 rooma)
(at ball11 rooma)
(at ball12 rooma)
(at ball13 rooma)
(at ball14 rooma)
(at ball15 rooma)
(at ball16 rooma)
(at ball17 rooma)
(at ball18 rooma)
(at ball19 rooma)
(at ball20 rooma)
(at ball21 rooma)
(at ball22 rooma)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 room3)
(at ball14 room3)
(at ball15 room3)
(at ball16 room3)
(at ball17 room3)
(at ball18 room4)
(at ball19 room4)
(at ball20 room4)
(at ball21 room4)
(at ball22 room4)
)
)
)

; plan
1. (pick ball17 rooma left)
   deleted: (at ball17 rooma) (free left)
   added: (carry ball17 left)
   goals met: 7 of 22
2. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 7 of 22
3. (drop ball17 room3 left)
   deleted: (carry ball17 left)
   added: (at ball17 room3) (free left)
   goals met: 8 of 22
4. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 8 of 22
5. (pick ball9 rooma left)
   deleted: (at ball9 rooma) (free left)
   added: (carry ball9 left)
   goals met: 8 of 22
6. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 8 of 22
7. (drop ball9 roomb left)
   deleted: (carry ball9 left)
   added: (at ball9 roomb) (free left)
   goals met: 9 of 22
8. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 9 of 22
9. (pick ball8 rooma left)
   deleted: (at ball8 rooma) (free left)
   added: (carry ball8 left)
   goals met: 9 of 22
10. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 9 of 22
11. (drop ball8 roomb left)
   deleted: (carry ball8 left)
   added: (at ball8 roomb) (free left)
   goals met: 10 of 22
12. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 10 of 22
13. (pick ball22 rooma left)
   deleted: (at ball22 rooma) (free left)
   added: (carry ball22 left)
   goals met: 10 of 22
14. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 10 of 22
15. (drop ball22 room4 left)
   deleted: (carry ball22 left)
   added: (at ball22 room4) (free left)
   goals met: 11 of 22
16. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 11 of 22
17. (pick ball21 rooma left)
   deleted: (at ball21 rooma) (free left)
   added: (carry ball21 left)
   goals met: 11 of 22
18. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 11 of 22
19. (drop ball21 room4 left)
   deleted: (carry ball21 left)
   added: (at ball21 room4) (free left)
   goals met: 12 of 22
20. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 12 of 22
21. (pick ball20 rooma left)
   deleted: (at ball20 rooma) (free left)
   added: (carry ball20 left)
   goals met: 12 of 22
22. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 12 of 22
23. (drop ball20 room4 left)
   deleted: (carry ball20 left)
   added: (at ball20 room4) (free left)
   goals met: 13 of 22
24. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 13 of 22
25. (pick ball19 rooma left)
   deleted: (at ball19 rooma) (free left)
   added: (carry ball19 left)
   goals met: 13 of 22
26. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 13 of 22
27. (drop ball19 room4 left)
   deleted: (carry ball19 left)
   added: (at ball19 room4) (free left)
   goals met: 14 of 22
28. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 14 of 22
29. (pick ball18 rooma left)
   deleted: (at ball18 rooma) (free left)
   added: (carry ball18 left)
   goals met: 14 of 22
30. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 14 of 22
31. (drop ball18 room4 left)
   deleted: (carry ball18 left)
   added: (at ball18 room4) (free left)
   goals met: 15 of 22
32. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 15 of 22
33. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 15 of 22
34. (pick ball16 rooma left)
   deleted: (at ball16 rooma) (free left)
   added: (carry ball16 left)
   goals met: 15 of 22
35. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 15 of 22
36. (drop ball16 room3 left)
   deleted: (carry ball16 left)
   added: (at ball16 room3) (free left)
   goals met: 16 of 22
37. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 16 of 22
38. (pick ball15 rooma left)
   deleted: (at ball15 rooma) (free left)
   added: (carry ball15 left)
   goals met: 16 of 22
39. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 16 of 22
40. (drop ball15 room3 left)
   deleted: (carry ball15 left)
   added: (at ball15 room3) (free left)
   goals met: 17 of 22
41. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 17 of 22
42. (pick ball14 rooma left)
   deleted: (at ball14 rooma) (free left)
   added: (carry ball14 left)
   goals met: 17 of 22
43. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 17 of 22
44. (drop ball14 room3 left)
   deleted: (carry ball14 left)
   added: (at ball14 room3) (free left)
   goals met: 18 of 22
45. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 18 of 22
46. (pick ball13 rooma left)
   deleted: (at ball13 rooma) (free left)
   added: (carry ball13 left)
   goals met: 18 of 22
47. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 18 of 22
48. (drop ball13 room3 left)
   deleted: (carry ball13 left)
   added: (at ball13 room3) (free left)
   goals met: 19 of 22
49. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 19 of 22
50. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 19 of 22
51. (pick ball12 rooma left)
   deleted: (at ball12 rooma) (free left)
   added: (carry ball12 left)
   goals met: 19 of 22
52. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 19 of 22
53. (drop ball12 roomb left)
   deleted: (carry ball12 left)
   added: (at ball12 roomb) (free left)
   goals met: 20 of 22
54. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 20 of 22
55. (pick ball11 rooma left)
   deleted: (at ball11 rooma) (free left)
   added: (carry ball11 left)
   goals met: 20 of 22
56. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 20 of 22
57. (drop ball11 roomb left)
   deleted: (carry ball11 left)
   added: (at ball11 roomb) (free left)
   goals met: 21 of 22
58. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 21 of 22
59. (pick ball10 rooma left)
   deleted: (at ball10 rooma) (free left)
   added: (carry ball10 left)
   goals met: 21 of 22
60. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 21 of 22
61. (drop ball10 roomb left)
   deleted: (carry ball10 left)
   added: (at ball10 roomb) (free left)
   goals met: 22 of 22
